const _scheduleConfig = {
    countdown_target: '2024-5-18',
    week_display: true,
    subject_name: {
        '测@语': '语文周测',
        '测@数': '数学周测',
        '测@英': '英语周测',
        '测@物': '物理周测',
        '测@化': '化学周测',
        '测@生': '生物周测',
        '自': '自习',
        '物': '物理',
        '英': '英语',
        '化': '化学',
        '语': '语文',
        '体': '体育',
        '数': '数学',
        '生': '生物',
        '地': '地理',
        '史': '历史',
        '政': '政治',
        '早': '早读',
        '晚': '晚读'
    },
    timetable: {
        workday: {
            '00:00-07:09': '早读',
            '07:10-07:39': '早餐',
            '07:40-08:19': 0,
            '08:20-08:29': '课间',
            '08:30-09:09': 1,
            '09:10-09:19': '课间',
            '09:20-09:59': 2,
            '10:00-10:19': '大课间',
            '10:20-10:59': 3,
            '11:00-11:49': 4,
            '11:50-12:19': '午餐',
            '12:20-14:29': '午自习',
            '14:30-15:09': 5,
            '15:10-15:19': '课间',
            '15:20-15:59': 6,
            '16:00-16:29': '大课间',
            '16:30-17:09': 7,
            '17:10-17:46': 8,
            '17:47-18:19': '晚餐',
            '18:20-18:59': '晚读',
            '19:00-19:29': '晚自习',
            '19:30-19:39': '课间',
            '19:40-20:29': 9,
            '20:30-20:39': '课间',
            '20:40-21:29': 10,
            '21:30-23:59': '放学'
        },
        saturday: {
            '00:00-07:09': '早读',
            '07:10-07:39': '早餐',
            '07:40-08:19': 0,
            '08:20-08:29': '课间',
            '08:30-09:09': 1,
            '09:10-09:19': '课间',
            '09:20-09:59': 2,
            '10:00-10:19': '大课间',
            '10:20-10:59': 3,
            '11:00-11:49': 4,
            '11:50-12:19': '午餐',
            '12:20-14:29': '午自习',
            '14:30-15:09': 5,
            '15:10-15:19': '课间',
            '15:20-15:59': 6,
            '16:00-16:09': '课间',
            '16:10-16:49': 7,
            '16:50-23:59': '放学'
        }
    },
    divider: {
        workday: [4, 8],
        saturday: [4, 5]
    },
    daily_class: [
        {
            Chinese: '日',
            English: 'SUN',
            classList: ['语', '物', '英', '自', '体', '生', '数', '地', '自', '化', '英'],
            timetable: 'workday'
        },
        {
            Chinese: '一',
            English: 'MON',
            classList: ['英', '物', '化', '数', '生', '语', '自', '自', '自', '自'],
            timetable: 'workday'
        },
        {
            Chinese: '二',
            English: 'TUE',
            classList: ['英', '物', '化', '数', '生', '语', '自', '自', '自', '自'],
            timetable: 'workday'
        },
        {
            Chinese: '三',
            English: 'WED',
            classList: ['英', '物', '化', '数', '生', '语', '自', '自', '自', '自'],
            timetable: 'workday'
        },
        {
            Chinese: '四',
            English: 'THR',
            classList: ['英', '物', '化', '数', '生', '语', '自', '自', '自', '自'],
            timetable: 'workday'
        },
        {
            Chinese: '五',
            English: 'FRI',
            classList: ['语', '物', '英', '自', '体', '生', '数', '地', '自', '化', '英'],
            timetable: 'workday'
        },
        {
            Chinese: '六',
            English: 'SAT',
            classList: ['英', '物', '化', '数', '生', '语', '自', '自'],
            timetable: 'saturday'
        }
    ],
    css_style: {
        '--center-font-size': '50px',
        '--corner-font-size': '14px',
        '--countdown-font-size': '28px',
        '--global-border-radius': '16px',
        '--global-bg-opacity': '0.5',
        '--container-bg-padding': '8px 14px',
        '--countdown-bg-padding': '5px 12px',
        '--container-space': '16px',
        '--top-space': '16px',
        '--main-horizontal-space': '8px',
        '--divider-width': '2px',
        '--divider-margin': '6px',
        '--triangle-s
